import { useState } from 'react';
import Image from 'next/image';
import Link from 'next/link';
import styles from '/styles/Main.module.scss';

import img from '../public/img/about.jpg';
import deliveryImg from '../public/img/delivery.jpg';

import ImageSlider from './ImageSlider';
import OrderForm from './OrderForm';
import logo from '../public/img/logo.png';

export default function Main() {
    const [showFBForm, setShowFBForm] = useState(false);
    const [orderIndex, setOrderIndex] = useState();
    const [orderData, setOrderData] = useState([
        {
            name: 'Строительные леса',
            id: 'scaffold',

            description:
                'Это профессиональное оборудование, которое ставится и используется рабочими для возведения стен или их покраски, ремонта, установки, штукатурки.',
        },
        {
            name: 'Телескопические стойки',
            id: 'stoiki',

            description:
                'Это несущий элемент опалубки перекрытий. С ее помощью строят монолитные перекрытия высотой до 5,5 метров. Телескопические стойки для опалубки удерживают ее в статичном положении.',
        },
    ]);

    function clickHandler(index) {
        setShowFBForm((prev) => !prev);
    }

    function FeedBackBtn({ style, title, header, text, children }) {
        if (style) {
            return (
                <button onClick={clickHandler} className={styles.FeedBackBtn}>
                    {title}
                </button>
            );
        } else {
            return (
                <div className={styles.OrderBtn}>
                    <div className={styles.OrderBtnContent}>
                        <h3>{header}</h3>
                        <p>{text}</p>
                    </div>
                    <button onClick={clickHandler}>Оставить заявку</button>
                </div>
            );
        }
    }

    // function FeedBackBtn({ title, data, index }) {
    //     if (data) {
    //         return (
    //             <button
    //                 onClick={index ? () => clickHandler(index) : clickHandler}
    //                 className={styles.OrderBtn}>
    //                 <h2>{data.name}</h2>
    //                 <p>{data.description}</p>
    //             </button>
    //         );
    //     }
    //     return (
    //         <button onClick={clickHandler} className={styles.FeedBackBtn}>
    //             {title}
    //         </button>
    //     );
    // }

    return (
        <>
            <header className={styles.Header}>
                <div className="container-flex">
                    <div className="content-block">
                        <div className={styles.LogoBlock}>
                            <div className={styles.Logo}>
                                <Image src={logo} width={100} height={66} />
                            </div>

                            <div className={styles.LogoContent}>
                                <p>
                                    <span>ИП</span> Кайрат
                                </p>
                                <h1>АРЕНДА СТРОИТЕЛЬНЫХ ЛЕСОВ</h1>
                            </div>
                        </div>

                        <div className={styles.Contacts}>
                            <div className={styles.Social}>
                                <ul>
                                    <li>
                                        <Link href="https://wa.me/77012256121">
                                            <a target="_blank" rel="noopener noreferrer">
                                                <svg fill="#000000" viewBox="0 0 50 50">
                                                    <path d="M25,2C12.318,2,2,12.318,2,25c0,3.96,1.023,7.854,2.963,11.29L2.037,46.73c-0.096,0.343-0.003,0.711,0.245,0.966 C2.473,47.893,2.733,48,3,48c0.08,0,0.161-0.01,0.24-0.029l10.896-2.699C17.463,47.058,21.21,48,25,48c12.682,0,23-10.318,23-23 S37.682,2,25,2z M36.57,33.116c-0.492,1.362-2.852,2.605-3.986,2.772c-1.018,0.149-2.306,0.213-3.72-0.231 c-0.857-0.27-1.957-0.628-3.366-1.229c-5.923-2.526-9.791-8.415-10.087-8.804C15.116,25.235,13,22.463,13,19.594 s1.525-4.28,2.067-4.864c0.542-0.584,1.181-0.73,1.575-0.73s0.787,0.005,1.132,0.021c0.363,0.018,0.85-0.137,1.329,1.001 c0.492,1.168,1.673,4.037,1.819,4.33c0.148,0.292,0.246,0.633,0.05,1.022c-0.196,0.389-0.294,0.632-0.59,0.973 s-0.62,0.76-0.886,1.022c-0.296,0.291-0.603,0.606-0.259,1.19c0.344,0.584,1.529,2.493,3.285,4.039 c2.255,1.986,4.158,2.602,4.748,2.894c0.59,0.292,0.935,0.243,1.279-0.146c0.344-0.39,1.476-1.703,1.869-2.286 s0.787-0.487,1.329-0.292c0.542,0.194,3.445,1.604,4.035,1.896c0.59,0.292,0.984,0.438,1.132,0.681 C37.062,30.587,37.062,31.755,36.57,33.116z" />
                                                </svg>
                                                <p>+7(701)225-61-21</p>
                                            </a>
                                        </Link>
                                    </li>
                                    <li>
                                        <Link href="mailto:kayratb@mail.ru">
                                            <a target="_blank" rel="noopener noreferrer">
                                                <svg fill="#000000" viewBox="0 0 50 50">
                                                    <path d="M 14 4 C 8.4886661 4 4 8.4886661 4 14 L 4 36 C 4 41.511334 8.4886661 46 14 46 L 36 46 C 41.511334 46 46 41.511334 46 36 L 46 14 C 46 8.4886661 41.511334 4 36 4 L 14 4 z M 13 16 L 37 16 C 37.18 16 37.349766 16.020312 37.509766 16.070312 L 27.679688 25.890625 C 26.199688 27.370625 23.790547 27.370625 22.310547 25.890625 L 12.490234 16.070312 C 12.650234 16.020312 12.82 16 13 16 z M 11.070312 17.490234 L 18.589844 25 L 11.070312 32.509766 C 11.020312 32.349766 11 32.18 11 32 L 11 18 C 11 17.82 11.020312 17.650234 11.070312 17.490234 z M 38.929688 17.490234 C 38.979688 17.650234 39 17.82 39 18 L 39 32 C 39 32.18 38.979687 32.349766 38.929688 32.509766 L 31.400391 25 L 38.929688 17.490234 z M 20 26.410156 L 20.890625 27.310547 C 22.020625 28.440547 23.510234 29 24.990234 29 C 26.480234 29 27.959844 28.440547 29.089844 27.310547 L 29.990234 26.410156 L 37.509766 33.929688 C 37.349766 33.979688 37.18 34 37 34 L 13 34 C 12.82 34 12.650234 33.979687 12.490234 33.929688 L 20 26.410156 z" />
                                                </svg>
                                                <p>kayratb@mail.ru</p>
                                            </a>
                                        </Link>
                                    </li>
                                </ul>
                            </div>
                            <FeedBackBtn title="Заказать звонок" style={true} />
                        </div>
                    </div>
                </div>
                <div className={styles.HeaderBot}>
                    <div className="container-flex">
                        <div className={styles.Menu}>
                            <ul>
                                <li>
                                    <Link href="#about">
                                        <a>О Компании</a>
                                    </Link>
                                </li>
                                <li>
                                    <Link href="#products">
                                        <a>Товары</a>
                                    </Link>
                                </li>
                                <li>
                                    <Link href="#services">
                                        <a>Услуги</a>
                                    </Link>
                                </li>
                            </ul>
                        </div>
                    </div>
                </div>
            </header>
            <main className={styles.Main}>
                <section className={styles.CompanyBlock} id="about">
                    <div className={styles.Wrapper}>
                        <h2>О Компании</h2>
                        <div className={styles.AboutCompany}>
                            <p>
                                &nbsp;&nbsp;&nbsp;С 2016 года предоставляем нашим клиентам
                                качественные и недорогие инструменты для строительства домов и
                                зданий.
                                <br />
                                &nbsp;&nbsp;&nbsp;Наша миссия - облегчить жизнь и уменьшить головную
                                боль при поиске удобных товаров.
                                <br />
                                &nbsp;&nbsp;&nbsp;Мы сами все доставим, Вам не придется никуда
                                ехать.
                                <br />
                                &nbsp;&nbsp;&nbsp;Индивидуально подходим к каждому клиенту, решаем
                                любые вопросы.
                            </p>

                            <Image src={img} width={585} height={480} objectFit="cover" />
                        </div>
                        <div className={styles.AdvantagesWrapper}>
                            <div className={styles.AdvantagesBlock}>
                                <div className={`${styles.Experience} ${styles.AdvantageBox}`}>
                                    <div className={styles.SvgBox}>
                                        <svg viewBox="0 0 100 100">
                                            <path
                                                d="M90.8,63.1L79,39.5C78.7,20.4,63.1,5,44,5C24.7,5,9,20.7,9,40v53c0,1.1,0.9,2,2,2h33c1.1,0,2-0.9,2-2V82h31c1.1,0,2-0.9,2-2
                                        V66h10c0.7,0,1.3-0.4,1.7-0.9C91.1,64.5,91.1,63.7,90.8,63.1z M77,62c-1.1,0-2,0.9-2,2v14H44c-1.1,0-2,0.9-2,2v11H13V40
                                        C13,22.9,26.9,9,44,9c17.1,0,31,13.9,31,31c0,0.3,0.1,0.6,0.2,0.9L85.8,62H77z M68,40c0,6.6-2.6,12.7-7.3,17.2
                                        c-1.7,1.7-3.7,3.1-5.8,4.1c-0.3,0.1-0.6,0.2-0.9,0.2c-0.7,0-1.4-0.4-1.8-1.1c-0.5-1-0.1-2.2,0.9-2.7c1.8-0.9,3.4-2.1,4.8-3.5
                                        C61.8,50.6,64,45.5,64,40c0-11-9-20-20-20c-11,0-20,9-20,20c0,7.6,4.2,14.4,10.9,17.8c1,0.5,1.4,1.7,0.9,2.7s-1.7,1.4-2.7,0.9
                                        C25,57.3,20,49.1,20,40c0-13.2,10.8-24,24-24C57.2,16,68,26.8,68,40z M51.4,39.6c0.8,0.8,0.8,2,0,2.8C51,42.8,50.5,43,50,43
                                        s-1-0.2-1.4-0.6L46,39.8V67c0,1.1-0.9,2-2,2s-2-0.9-2-2V39.8l-2.6,2.6C39,42.8,38.5,43,38,43s-1-0.2-1.4-0.6c-0.8-0.8-0.8-2,0-2.8
                                        l6-6c0.8-0.8,2-0.8,2.8,0L51.4,39.6z"
                                            />
                                        </svg>
                                    </div>

                                    <p>Большой опыт работы</p>
                                </div>

                                <div className={`${styles.Quality} ${styles.AdvantageBox}`}>
                                    <div className={styles.SvgBox}>
                                        <svg viewBox="0 0 24 24">
                                            <path d="M12 2C8.13401 2 5 5.13401 5 9C5 10.8472 5.71414 12.5253 6.88327 13.777C8.1622 15.1462 9.98061 16 12 16C14.0194 16 15.8378 15.1462 17.1167 13.777C18.2859 12.5253 19 10.8472 19 9C19 5.13401 15.866 2 12 2ZM3 9C3 4.02944 7.02944 0 12 0C16.9706 0 21 4.02944 21 9C21 11.1767 20.2261 13.1745 18.94 14.7306L20.508 21.3163C20.8903 22.922 19.2729 24.2734 17.7608 23.6119L12 21.0915L6.23923 23.6119C4.72708 24.2734 3.10968 22.922 3.49197 21.3163L5.05999 14.7306C3.77385 13.1745 3 11.1767 3 9ZM6.74119 16.3044L5.43759 21.7795L11.1984 19.2592C11.7094 19.0356 12.2906 19.0356 12.8016 19.2592L18.5624 21.7795L17.2588 16.3044C15.7798 17.3708 13.963 18 12 18C10.037 18 8.22016 17.3708 6.74119 16.3044ZM16.7071 6.29289C17.0976 6.68342 17.0976 7.31658 16.7071 7.70711L12.7071 11.7071C12.3166 12.0976 11.6834 12.0976 11.2929 11.7071L9.29289 9.70711C8.90237 9.31658 8.90237 8.68342 9.29289 8.29289C9.68342 7.90237 10.3166 7.90237 10.7071 8.29289L12 9.58579L15.2929 6.29289C15.6834 5.90237 16.3166 5.90237 16.7071 6.29289Z" />
                                        </svg>
                                    </div>
                                    <p>Гарантия качества</p>
                                </div>

                                <div className={`${styles.Services} ${styles.AdvantageBox}`}>
                                    <div className={styles.SvgBox}>
                                        <svg viewBox="0 0 48 48" enableBackground="new 0 0 48 48">
                                            <path
                                                fill="#E65100"
                                                d="M25.6,34.4c0.1-0.4,0.1-0.9,0.1-1.4s0-0.9-0.1-1.4l2.8-2c0.3-0.2,0.4-0.6,0.2-0.9l-2.7-4.6 c-0.2-0.3-0.5-0.4-0.8-0.3L22,25.3c-0.7-0.6-1.5-1-2.4-1.4l-0.3-3.4c0-0.3-0.3-0.6-0.6-0.6h-5.3c-0.3,0-0.6,0.3-0.6,0.6L12.4,24 c-0.9,0.3-1.6,0.8-2.4,1.4l-3.1-1.4c-0.3-0.1-0.7,0-0.8,0.3l-2.7,4.6c-0.2,0.3-0.1,0.7,0.2,0.9l2.8,2c-0.1,0.4-0.1,0.9-0.1,1.4 s0,0.9,0.1,1.4l-2.8,2c-0.3,0.2-0.4,0.6-0.2,0.9l2.7,4.6c0.2,0.3,0.5,0.4,0.8,0.3l3.1-1.4c0.7,0.6,1.5,1,2.4,1.4l0.3,3.4 c0,0.3,0.3,0.6,0.6,0.6h5.3c0.3,0,0.6-0.3,0.6-0.6l0.3-3.4c0.9-0.3,1.6-0.8,2.4-1.4l3.1,1.4c0.3,0.1,0.7,0,0.8-0.3l2.7-4.6 c0.2-0.3,0.1-0.7-0.2-0.9L25.6,34.4z M16,38c-2.8,0-5-2.2-5-5c0-2.8,2.2-5,5-5c2.8,0,5,2.2,5,5C21,35.8,18.8,38,16,38z"
                                            />
                                            <path
                                                fill="#FFA000"
                                                d="M41.9,15.3C42,14.8,42,14.4,42,14s0-0.8-0.1-1.3l2.5-1.8c0.3-0.2,0.3-0.5,0.2-0.8l-2.5-4.3 c-0.2-0.3-0.5-0.4-0.8-0.2l-2.9,1.3c-0.7-0.5-1.4-0.9-2.2-1.3l-0.3-3.1C36,2.2,35.8,2,35.5,2h-4.9c-0.3,0-0.6,0.2-0.6,0.5l-0.3,3.1 c-0.8,0.3-1.5,0.7-2.2,1.3l-2.9-1.3c-0.3-0.1-0.6,0-0.8,0.2l-2.5,4.3c-0.2,0.3-0.1,0.6,0.2,0.8l2.5,1.8C24,13.2,24,13.6,24,14 s0,0.8,0.1,1.3l-2.5,1.8c-0.3,0.2-0.3,0.5-0.2,0.8l2.5,4.3c0.2,0.3,0.5,0.4,0.8,0.2l2.9-1.3c0.7,0.5,1.4,0.9,2.2,1.3l0.3,3.1 c0,0.3,0.3,0.5,0.6,0.5h4.9c0.3,0,0.6-0.2,0.6-0.5l0.3-3.1c0.8-0.3,1.5-0.7,2.2-1.3l2.9,1.3c0.3,0.1,0.6,0,0.8-0.2l2.5-4.3 c0.2-0.3,0.1-0.6-0.2-0.8L41.9,15.3z M33,19c-2.8,0-5-2.2-5-5c0-2.8,2.2-5,5-5c2.8,0,5,2.2,5,5C38,16.8,35.8,19,33,19z"
                                            />
                                        </svg>
                                    </div>
                                    <p>Полный сервис услуг</p>
                                </div>

                                <div className={`${styles.Decisions} ${styles.AdvantageBox}`}>
                                    <div className={styles.SvgBox}>
                                        <svg viewBox="0 0 64 64">
                                            <path d="M19.926,17.768l-.756.418a2.239,2.239,0,0,0-1.1,1.389,2.187,2.187,0,0,0,.244,1.709l2.094,3.466a2.352,2.352,0,0,0,3.123.816l.766-.422a.393.393,0,0,1,.413.053,12.123,12.123,0,0,0,2.662,1.477c.111.045.223.137.223.241v.836A2.281,2.281,0,0,0,29.906,30h4.188A2.281,2.281,0,0,0,36.4,27.751v-.836c0-.1.112-.2.223-.241A12.115,12.115,0,0,0,39.286,25.2a.394.394,0,0,1,.413-.052l.764.422a2.353,2.353,0,0,0,3.124-.816l2.094-3.466a2.187,2.187,0,0,0,.244-1.709,2.239,2.239,0,0,0-1.095-1.389l-.757-.418a.226.226,0,0,1-.136-.2,10.984,10.984,0,0,0,0-3.143.226.226,0,0,1,.137-.2l.756-.418a2.239,2.239,0,0,0,1.095-1.389,2.187,2.187,0,0,0-.244-1.709L43.587,7.25a2.349,2.349,0,0,0-3.123-.816l-.766.422a.389.389,0,0,1-.413-.053,12.123,12.123,0,0,0-2.662-1.477c-.111-.045-.223-.137-.223-.241V4.249A2.281,2.281,0,0,0,34.094,2H29.906A2.281,2.281,0,0,0,27.6,4.249v.836c0,.1-.112.2-.223.241A12.115,12.115,0,0,0,24.714,6.8a.392.392,0,0,1-.413.052l-.764-.422a2.349,2.349,0,0,0-3.124.816l-2.094,3.466a2.187,2.187,0,0,0-.244,1.709,2.239,2.239,0,0,0,1.1,1.389l.757.418a.226.226,0,0,1,.136.2,10.984,10.984,0,0,0,0,3.143A.226.226,0,0,1,19.926,17.768Zm.211,2.169.756-.418a2.221,2.221,0,0,0,1.15-2.232,8.952,8.952,0,0,1,0-2.574,2.221,2.221,0,0,0-1.15-2.232l-.756-.418a.253.253,0,0,1-.13-.155.2.2,0,0,1,.024-.158l2.094-3.466a.342.342,0,0,1,.445-.1l.764.422a2.4,2.4,0,0,0,2.562-.19,10.179,10.179,0,0,1,2.225-1.235,2.28,2.28,0,0,0,1.479-2.1V4.249A.286.286,0,0,1,29.906,4h4.188a.286.286,0,0,1,.306.249v.836a2.28,2.28,0,0,0,1.479,2.1A10.186,10.186,0,0,1,38.1,8.416a2.391,2.391,0,0,0,2.562.191l.765-.422a.341.341,0,0,1,.445.1l2.094,3.466a.2.2,0,0,1,.024.158.253.253,0,0,1-.13.155l-.756.418a2.221,2.221,0,0,0-1.15,2.232,8.952,8.952,0,0,1,0,2.574,2.221,2.221,0,0,0,1.15,2.232l.756.418a.253.253,0,0,1,.13.155.2.2,0,0,1-.024.158l-2.094,3.466a.342.342,0,0,1-.445.1l-.764-.422a2.4,2.4,0,0,0-2.562.19,10.179,10.179,0,0,1-2.225,1.235,2.28,2.28,0,0,0-1.479,2.1v.836a.286.286,0,0,1-.306.249H29.906a.286.286,0,0,1-.306-.249v-.836a2.28,2.28,0,0,0-1.479-2.1A10.186,10.186,0,0,1,25.9,23.584a2.448,2.448,0,0,0-1.444-.476,2.307,2.307,0,0,0-1.118.285l-.765.422a.34.34,0,0,1-.445-.1L20.031,20.25a.2.2,0,0,1-.024-.158A.253.253,0,0,1,20.137,19.937Z" />
                                            <path d="M32,23a7,7,0,1,0-7-7A7.008,7.008,0,0,0,32,23Zm0-12a5,5,0,1,1-5,5A5.006,5.006,0,0,1,32,11Z" />
                                            <path d="M56.625,11.219A1,1,0,0,0,55,12v3H48v2h7v3a1,1,0,0,0,1.625.781l5-4a1,1,0,0,0,0-1.562Zm.375,6.7V14.081L59.4,16Z" />
                                            <path d="M7.375,20.781A1,1,0,0,0,9,20V17h7V15H9V12a1,1,0,0,0-1.625-.781l-5,4a1,1,0,0,0,0,1.562ZM7,14.081v3.838L4.6,16Z" />
                                            <path d="M40.394,49.081A1,1,0,0,0,39,50V62h2V51.517l5.6,2.4a1,1,0,0,0,1.1-.212l8-8a1,1,0,0,0-.152-1.539l-3-2a1,1,0,0,0-1.2.064l-5.5,4.581L41.3,44.529A5.02,5.02,0,0,0,39.059,44H34.391a6,6,0,1,0-4.782,0H24.947a5.029,5.029,0,0,0-2.235.527l-4.574,2.286-5.5-4.581a1,1,0,0,0-1.194-.065l-3,2a1,1,0,0,0-.152,1.54l8,8a1,1,0,0,0,1.1.212l5.61-2.4V62h2V50a1,1,0,0,0-1.394-.919l-6.381,2.733-6.658-6.658,1.366-.91,5.427,4.522a1,1,0,0,0,1.087.127l5.159-2.579A3.017,3.017,0,0,1,24.947,46H30.78l-1.76,8.8a1,1,0,0,0,.148.751l2,3a1,1,0,0,0,1.664,0l2-3a1,1,0,0,0,.148-.751L33.22,46h5.839a3.009,3.009,0,0,1,1.342.317L45.553,48.9a1,1,0,0,0,1.087-.127l5.426-4.521,1.361.908-6.659,6.659ZM32,56.2l-.938-1.407L32,50.1l.938,4.691Zm0-13.7a4,4,0,1,1,4-4A4,4,0,0,1,32,42.5Z" />
                                        </svg>
                                    </div>
                                    <p>Поиск решений</p>
                                </div>
                            </div>
                        </div>
                    </div>
                </section>

                <section className={styles.ProductsBlock} id="products">
                    <div className={styles.Wrapper}>
                        <h2>Товары</h2>
                        <div className={styles.Products}>
                            <div className={styles.ProductsList}>
                                <ImageSlider product="lesa" />
                                <FeedBackBtn
                                    style={null}
                                    header="Строительные леса"
                                    text="Это профессиональное оборудование, которое используется рабочими для возведения стен или их покраски, ремонта, установки, штукатурки."
                                />
                            </div>
                            <div className={styles.ProductsList}>
                                <ImageSlider product="stoiki" />
                                <FeedBackBtn
                                    style={null}
                                    header="Телескопические стойки"
                                    text="Это несущий элемент опалубки перекрытий. С её помощью строят монолитные перекрытия высотой до 3,5 метров. Телескопические стойки для опалубки удерживают ее в статичном положении."
                                />
                            </div>
                        </div>
                    </div>
                </section>
                <section className={styles.ServicesBlock}>
                    <div className={styles.Wrapper}>
                        <div className={styles.Services} id="services">
                            <h2>Доставка</h2>

                            <div className={styles.ServicesItem}>
                                <div className={styles.ServicesDescr}>
                                    <p>
                                        Осуществляется по Алматы и всей Алматинской области. <br />
                                        Стоимость доставки от 3000 до 5000 тг.
                                    </p>
                                    
                                    <ul>
                                    <p>Преимущества нашей доставки:</p>
                                        <li>Скорость</li>
                                        <li>Сохранность</li>
                                        <li>Надежность</li>
                                        <li>Доступность</li>
                                    </ul>
                                    <div className={styles.ServicesBtnBlock}>
                                        <FeedBackBtn title="Оставить заявку" style={true} />
                                    </div>
                                </div>

                                <Image
                                    src={deliveryImg}
                                    width={600}
                                    height={500}
                                    objectFit="cover"
                                />
                            </div>
                        </div>
                    </div>
                </section>
                <OrderForm
                    clickHandler={clickHandler}
                    showForm={showFBForm}
                    orderData={orderData}
                    orderIndex={orderIndex}
                />
            </main>
        </>
    );
}
